{
  "name": "Leafpress",
  "url": "https://www.workatastartup.com/companies/leafpress",
  "batch": "(S23)",
  "company_image": "https://bookface-images.s3.amazonaws.com/small_logos/046a138a54a89d5f88af4355ea9e901c1a337397.png",
  "byline": "AI Utility Data Management",
  "tags": [
    "2 people",
    "B2B Software and Services"
  ],
  "job_links": [
    "https://www.workatastartup.com/jobs/66521",
    "https://www.workatastartup.com/jobs/64687",
    "https://www.workatastartup.com/jobs/65379",
    "https://www.workatastartup.com/jobs/67187"
  ],
  "founders": [
    {
      "founder_name": "Devishi Jha",
      "founder_image": "https://bookface-images.s3.amazonaws.com/avatars/cb2217a6e0ab8ee312bc06ee4bab112fa66797f7.jpg",
      "founder_description": "Devi dropped out from Harvard with a degree in Computer Science. She worked on the early ESG teams of Sephora, Spotify, and P&G. She is also an ESG mentor at Techstars.",
      "founder_linkedin": "https://linkedin.com/in/devishijha"
    },
    {
      "founder_name": "Jianna Liu",
      "founder_image": "https://bookface-images.s3.amazonaws.com/avatars/5a307385c0b4a352df28b9c0e145ebc2a76d04e2.jpg",
      "founder_description": "Jianna graduated from MIT with a degree in computer science. She has worked on the software teams at Meta, DoorDash, Nvidia, and the MIT School of Architecture and Planning.",
      "founder_linkedin": "https://linkedin.com/in/jianna-liu-90747413b"
    }
  ],
  "jobs": [
    {
      "job_url": "https://www.workatastartup.com/jobs/66521",
      "job_title": "SWE Intern at Leafpress (S23)",
      "salary_range": "$3K - $8K  •",
      "job_tags": [
        "San Francisco, CA, US / Remote (US)",
        "Internship"
      ],
      "job_description": "Skills: PythonAbout Leafpress\nLeafpress automates utility data collection for large real estate firms. We do this by extracting data from millions of utility bills at once, automating reporting to sustainability regulators.\nWe’re backed by Y Combinator and General Catalyst and generate significant annual recurring revenue. We’re on a high-growth trajectory and are looking for a QA engineer to join our team.\nIf you’re looking to build a billion dollar climate-tech AI company directly with the founding team, keep reading:\nPress on Leafpress\n\nOur favorite startups from YC's Summer 2023 Demo Day\n\nForbes 30u30\n\n\nY Combinator Launch\n\n\n🌎 The Problem we’re solving\n2023 was a record year for global temperatures, but also for climate regulatory pressure. More than two-thirds of global Fortune 500 companies have made significant climate pledges, and more than 10,000 companies are now required to file sustainability disclosures under the EU’s Corporate Sustainability Reporting Directive (CSRD).\nUnfortunately, with the tools we have today, sustainability teams spend upwards of 100M work hours annually sifting through utility data manually - on top of that, inaccurate data leads to millions in corporate fines.\n🧑‍💻 How we’re solving this problem\nLeafpress brings large language models to the fight against climate change. Our automated approach equips real estate companies with accurate data collected in minutes, not months.\n👋 The people you’ll be working with\nJianna (CTO & Co-founder): Jianna is a MIT alum who studied CS and has years of experience building software at Meta, DoorDash, and Nvidia. Jianna is lactose intolerant and loves matcha!\nDevi (CEO & Co-founder): Devi is a Harvard alum who studied CS and has experience in carbon accounting at Sephora, Spotify, and P&G. Devi is originally from Indiana (go Hoosiers)!\n🏗️ What you’ll be doing here:\nPreferred Qualifications\nWe are seeking a skilled SWE intern to assist us in building and integrating Python web scrapers.\nThe ideal candidate must have experience in Python programming and web scraping. Attention to detail, problem-solving skills, and the ability to work independently are essential in this role.\nRelevant skills:\n\nPython programming\nWeb scraping\n\nInterested?\nReach out to either Devi or Jianna on Linkedin or email us"
    },
    {
      "job_url": "https://www.workatastartup.com/jobs/64687",
      "job_title": "Full Stack Engineer at Leafpress (S23)",
      "salary_range": "$130K - $180K  •  0.50% - 2.00%",
      "job_tags": [
        "San Francisco, CA, US",
        "Full-time",
        "Any (new grads ok)"
      ],
      "job_description": "Leafpress is hiring: Full Stack Engineer\nAbout Leafpress\nLeafpress automates utility data collection for large real estate firms. We do this by extracting data from millions of utility bills at once, automating reporting to sustainability regulators.\nWe’re backed by Y Combinator and General Catalyst and generate significant annual recurring revenue. We’re on a high-growth trajectory and are looking for a full stack engineer to join our team.\nIf you’re looking to build a billion dollar climate-tech AI company directly with the founding team, keep reading:\nPress on Leafpress\n\nOur favorite startups from YC's Summer 2023 Demo Day\nForbes 30u30\nY Combinator Launch\n\n🌎 The Problem we’re solving\n2023 was a record year for global temperatures, but also for climate regulatory pressure. More than two-thirds of global Fortune 500 companies have made significant climate pledges, and more than 10,000 companies are now required to file sustainability disclosures under the EU’s Corporate Sustainability Reporting Directive (CSRD).\nUnfortunately, with the tools we have today, sustainability teams spend upwards of 100M work hours annually sifting through utility data manually - on top of that, inaccurate data leads to millions in corporate fines.\n🧑‍💻 How we’re solving this problem\nLeafpress brings large language models to the fight against climate change. Our automated approach equips real estate companies with accurate data collected in minutes, not months.\n📈 Why we’re hiring\nDemand for Leafpress has greatly exceeded expectations and outpaced our ability to build the product. We’re looking for a full stack engineer to join us as we apply the latest in AI technology to one of the most meaningful sectors in the world.\nThe People and Environment\n❤️ The culture you’ll be working in:\nWe move fast, and ship faster. We move quickly and are looking for teammates who are problem solvers. Working at a startup means learning something new every day - we value teammates who support each other in learning, growing, and building product.\nWe prioritize the team. We’re a team on a mission to solve arguably the greatest challenge facing humanity. Truly great things are never done by one person - they are done by a team of people. We are looking for someone who is ready to be challenged and inspired everyday by a positive, supportive team.\nWe are customer-first. We’re always learning, growing, and building to solve hair-on-fire problems for our customers. We spend a lot of time with our customers, and are always looking for ways to 10x their user experience.\n👋 The people you’ll be working with\nJianna (CTO & Co-founder): Jianna is a MIT alum who studied CS and has years of experience building software at Meta, DoorDash, and Nvidia. Jianna is lactose intolerant and loves matcha!\nDevi (CEO & Co-founder): Devi is a Harvard alum who studied CS and has experience in carbon accounting at Sephora, Spotify, and P&G. Devi is originally from Indiana (go Hoosiers)!\n🏗️ What you’ll be doing here:\nPreferred Qualifications\n\nFamiliarity with building LLM prompting and workflows\nProficiency in TypeScript\nExperience with SQL or similar\nFamiliarity with cloud services and deployment\nStrong problem-solving and communication skills\nAbility to work collaboratively in a team environment\n\nKey Responsibilities\n\nDevelop and maintain the backend services of Leafpress.\nCollaborate on feature requests, integrations, and documentation improvements.\nEngage with our customers for product feedback and contributions.\nWork closely with the product team to understand end-user requirements.\n\nThis role comes with significant responsibility, and we're seeking someone who embraces the opportunity to not only build customer-facing frontend and backend solutions but also to shape our core LLM workflows.\nWe are looking for someone who is eager to have responsibility and own their projects, which will include constructing frontend and backend solutions for our customers and influencing the development of our fundamental workflows. You will excel in this position if you aspire to collaborate closely with the full stack team and make a significant impact in addressing the most critical challenge of our time. We’re excited to grow together!\nInterested?\nReach out to either Devi or Jianna on Linkedin or email us!"
    },
    {
      "job_url": "https://www.workatastartup.com/jobs/65379",
      "job_title": "Account Executive at Leafpress (S23)",
      "salary_range": "$50K - $80K  •",
      "job_tags": [
        "San Francisco, CA, US / Boston, MA, US / Remote (US)",
        "Full-time",
        "1+ years"
      ],
      "job_description": "Leafpress is hiring: Account Executive\nAbout Leafpress\nLeafpress automates utility data collection for large enterprises. We do this by extracting data from millions of utility bills at once, automating energy analytics and saving.\nWe’re backed by Y Combinator and General Catalyst and generate significant annual recurring revenue. We’re on a high-growth trajectory and are looking for an AE to join our team.\nIf you’re looking to build a billion dollar climate-tech AI company directly with the founding team, keep reading:\nPress on Leafpress\n\nOur favorite startups from YC's Summer 2023 Demo Day\nForbes 30u30\nY Combinator Launch\n\n🌎 The Problem we’re solving\n2023 was a record year for global temperatures, but also for climate regulatory pressure. More than two-thirds of global Fortune 500 companies have made significant climate pledges, and more than 10,000 companies are now required to file sustainability disclosures under the EU’s Corporate Sustainability Reporting Directive (CSRD).\nUnfortunately, with the tools we have today, sustainability teams spend upwards of 100M work hours annually sifting through utility data manually - on top of that, inaccurate data leads to millions in corporate fines.\n🧑‍💻 How we’re solving this problem\nLeafpress brings large language models to the fight against climate change. Our automated approach equips real estate companies with accurate data collected in minutes, not months.\n📈 Why we’re hiring\nDemand for Leafpress has greatly exceeded expectations and outpaced our ability to build the product. We’re looking for an Account Executive to join us as we apply the latest in AI technology to one of the most meaningful sectors in the world.\n👋 The people you’ll be working with\nJianna (CTO & Co-founder): Jianna is a MIT alum who studied CS and has years of experience building software at Meta, DoorDash, and Nvidia. Jianna is lactose intolerant and loves matcha!\nDevi (CEO & Co-founder): Devi is a Harvard alum who studied CS and has experience in carbon accounting at Sephora, Spotify, and P&G. Devi is originally from Indiana (go Hoosiers)!\n🏗️ What you’ll be doing here:\nWe’re looking for our first GTM hire at Leafpress.\nYou’ll partner directly with Devi to bring Leafpress’s AI platforms to enterprise companies around the world.\nAbout you:\n\nHungry, resourceful and excited to shape Leafpress’s sales motion alongside the founders\nExperience in enterprise sales - either as an SDR/BDR, AE, Rev Ops etc.\nPrevious success at the earliest stages of company building (sub $5M ARR)\n\nWe don’t care about the logos on your resume - we care about the results that you’ve driven and your hunger for more ownership, accountability and responsibility.\nNote: we aren’t looking for part-time, remote or agencies.\nInterested?\nReach out to either Devi or Jianna on Linkedin"
    },
    {
      "job_url": "https://www.workatastartup.com/jobs/67187",
      "job_title": "Marketing Intern at Leafpress (S23)",
      "salary_range": "$3 - $8  •",
      "job_tags": [
        "Remote (US)",
        "Internship"
      ],
      "job_description": "Responsibilities:\n\n\nContent Development: Contribute to creating compelling and impactful content for our social media channels.\n\nStrategy Support: Assist in the development and implementation of social media strategies to boost our online presence.\n\nBrand Enhancement: Work with the marketing team to maintain and promote a cohesive brand image.\n\nIndustry Monitoring: Keep an eye on market trends and competitor activities to support content planning.\n\nCampaign Assistance: Support various marketing initiatives and campaigns, ensuring they run smoothly.\n\nPerformance Review: Help track and analyze the effectiveness of our social media efforts to refine strategies."
    }
  ]
}